Tekla Open API Reference for Tekla Structures 2025
AnalysisModelSeismicProperties Class
 The AnalysisModelSeismicProperties class contains information related to analysis model seismic properties.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisModelSeismicProperties
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisModelSeismicProperties
Public NotInheritable Class AnalysisModelSeismicProperties
The AnalysisModelSeismicProperties type exposes the following members.
Constructors
Name | Description
AnalysisModelSeismicProperties
Initializes a new instance of the AnalysisModelSeismicProperties class
Top
Properties
Name | Description
SeismicIncludeSelfWeightMass
 Indicates whether the selfweight is included.
SeismicMassLoadGroupFactors
 The factors of the mass load group.
SeismicMassLoadGroupIds
 The identifier of the mass load group.
SeismicParameters
 The seismic parameters.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace